In [ ]:
import pandas as pd

emp = pd.Series(['Dharshan','Sudeep','Siva','Yash','Keerthana'])
id = pd.Series([80,90,28,57,49])


frame = {'EMP': emp, 'ID': id}
result = pd.DataFrame(frame)

print(result)
print("\n Extracting One column:\n")
print(result['EMP'])
print("\n Adding new columns:\n")
result['ID'] = pd.Series([80, 90, 28, 56, 70])
result['Age'] = pd.Series([28, 32, 47, 52, 61])
print(result)

         EMP  ID
0   Dharshan  80
1     Sudeep  90
2       Siva  28
3       Yash  57
4  Keerthana  49

 Extracting One column:

0     Dharshan
1       Sudeep
2         Siva
3         Yash
4    Keerthana
Name: EMP, dtype: object

 Adding new columns:

         EMP  ID  Age
0   Dharshan  80   28
1     Sudeep  90   32
2       Siva  28   47
3       Yash  56   52
4  Keerthana  70   61

In [ ]:
print("\n Deleting new column: \n")
del result['Age']
print(result)

 Deleting new column:

         EMP  ID
0   Dharshan  80
1     Sudeep  90
2       Siva  28
3       Yash  56
4  Keerthana  70

In [ ]:
print("\n Extracting the second row: \n")
print(result.iloc[1])
print("slice rows:\n", result[1:4] )

 Extracting the second row:

EMP    Sudeep
ID         90
Name: 1, dtype: object
slice rows:
       EMP  ID
1  Sudeep  90
2    Siva  28
3    Yash  56

In [ ]:
d2 = pd.DataFrame([['Vicky', 100], ['Rashid', 110]], columns=['Emp', 'ID'])
print("\n Adding new row values:\n", pd.concat([result, d2], ignore_index=True))

 Adding new row values:
          EMP   ID     Emp
0   Dharshan   80     NaN
1     Sudeep   90     NaN
2       Siva   28     NaN
3       Yash   56     NaN
4  Keerthana   70     NaN
5        NaN  100   Vicky
6        NaN  110  Rashid

In [ ]:
print("\n Deleting particular row:\n",result.drop(2))

 Deleting particular row:
          EMP  ID
0   Dharshan  80
1     Sudeep  90
3       Yash  56
4  Keerthana  70